tap "getsentry/tools"
tap "marcusziade/songlink-cli"
tap "marcusziade/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "supabase/tap"
tap "xcodesorg/made"
brew "aria2"
brew "bash-completion"
brew "btop"
brew "cmake"
brew "deno"
brew "docker"
brew "docker-compose"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gradle"
brew "gradle-completion"
brew "openjdk"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "lazydocker"
brew "lua"
brew "mas"
brew "mpv"
brew "ncdu"
brew "neovim"
brew "node"
brew "pipx"
brew "pyright"
brew "python@3.12"
brew "render"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "swift"
brew "tesseract"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "xcbeautify"
brew "xcode-build-server"
brew "yt-dlp"
brew "getsentry/tools/sentry-cli"
brew "marcusziade/songlink-cli/songlink-cli"
brew "marcusziade/tap/pomme"
brew "marcusziade/tap/speedrun-cli"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
brew "supabase/tap/supabase"
brew "xcodesorg/made/xcodes"
cask "1password"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "balenaetcher"
cask "cleanshot"
cask "coconutbattery"
cask "discord"
cask "docker-desktop"
cask "flux"
cask "font-fira-code-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gitup-app"
cask "karabiner-elements"
cask "linearmouse"
cask "meetingbar"
cask "obs"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "steam"
cask "stolendata-mpv"
cask "tailscale"
cask "telegram"
cask "vivaldi"
mas "Pixelmator Pro", id: 1289583905
go "golang.org/x/tools/gopls"
cargo "wasm-bindgen-cli"
cargo "wasm-pack"
cargo "worker-build"
