tap "getsentry/tools"
tap "gromgit/fuse"
tap "marcusziade/songlink-cli"
tap "marcusziade/tap"
tap "oven-sh/bun"
tap "skiptools/skip"
tap "sst/tap"
tap "supabase/tap"
tap "xcodesorg/made"
brew "aria2"
brew "btop"
brew "cmake"
brew "deno"
brew "docker"
brew "docker-compose"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "git-lfs"
brew "go"
brew "gradle"
brew "imagemagick"
brew "iperf3"
brew "lazydocker"
brew "lua"
brew "mas"
brew "yt-dlp"
brew "mpv", link: false
brew "ncdu"
brew "neovim"
brew "node"
brew "ollama", restart_service: :changed
brew "opencode"
brew "p7zip"
brew "pipx"
brew "poppler"
brew "pyright"
brew "python@3.12"
brew "render"
brew "rsync"
brew "ruby"
brew "rust-analyzer"
brew "sentry-cli"
brew "supabase"
brew "tesseract"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "xcbeautify"
brew "xclogparser"
brew "xcode-build-server"
brew "xcodes"
brew "marcusziade/songlink-cli/songlink-cli"
brew "marcusziade/tap/pomme"
brew "marcusziade/tap/speedrun-cli"
brew "oven-sh/bun/bun"
cask "1password"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "balenaetcher"
cask "cleanshot"
cask "coconutbattery"
cask "discord"
cask "docker-desktop"
cask "flux-app"
cask "font-fira-code-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "gitup-app"
cask "karabiner-elements"
cask "linearmouse"
cask "meetingbar"
cask "obs"
cask "pcsx2"
cask "raycast"
cask "rectangle"
cask "steam"
cask "stolendata-mpv"
cask "telegram"
cask "vivaldi"
mas "Blackmagic Disk Speed Test", id: 425264550
cargo "emusync"
